{
    "common": {
        "name": "vis-material-advanced",
        "version": "1.0.0",
        "news": {
            "1.0.0": {
                "en": "no changes, upgrading to 1.0",
                "de": "Keine Änderungen, Upgrade auf 1.0",
                "ru": "без изменений, обновление до 1.0",
                "pt": "sem alterações, atualizando para 1.0",
                "nl": "geen wijzigingen, upgraden naar 1.0",
                "fr": "aucun changement, mise à niveau vers 1.0",
                "it": "nessuna modifica, aggiornamento alla 1.0",
                "es": "sin cambios, actualizando a 1.0",
                "pl": "bez zmian, aktualizacja do 1.0",
                "zh-cn": "无变化，升级到1.0"
            },
            "0.9.1": {
                "en": "some colorizeByValue options did not work",
                "de": "Einige colorizeByValue-Optionen funktionierten nicht",
                "ru": "некоторые параметры colorizeByValue не работали",
                "pt": "algumas opções colorizeByValue não funcionaram",
                "nl": "sommige colorizeByValue-opties werkten niet",
                "fr": "certaines options colorizeByValue ne fonctionnaient pas",
                "it": "alcune opzioni colorizeByValue non funzionavano",
                "es": "algunas opciones de colorizeByValue no funcionaron",
                "pl": "niektóre opcje colorizeByValue nie działały",
                "zh-cn": "一些colorizeByValue选项不起作用"
            },
            "0.9.0": {
                "en": "bugfix for ListNumber and ListText, Icon should never been shown",
                "de": "Bugfix für ListNumber und ListText, Icon sollte niemals angezeigt werden",
                "ru": "исправление для ListNumber и ListText, значок никогда не должен отображаться",
                "pt": "correção de bug para ListNumber e ListText, o ícone nunca deve ser mostrado",
                "nl": "bugfix voor ListNumber en ListText, Icon mag nooit getoond worden",
                "fr": "correction de bogue pour ListNumber et ListText, l'icône ne devrait jamais être affichée",
                "it": "bugfix per ListNumber e ListText, Icon non dovrebbe mai essere mostrato",
                "es": "corrección de errores para ListNumber y ListText, el icono nunca debería mostrarse",
                "pl": "poprawka dla ListNumber i ListText, ikona nigdy nie powinna być pokazywana",
                "zh-cn": "ListNumber和ListText，图标的错误修正永远不应该显示"
            },
            "0.8.15": {
                "en": "position of Elements and min - height finally? fixed :)",
                "de": "Position der Elemente und Mindesthöhe endlich? Fest :)",
                "ru": "положение элементов и min - высота наконец? фиксированный :)",
                "pt": "posição dos elementos e min - altura finalmente? corrigido :)",
                "nl": "positie van elementen en min - hoogte eindelijk? gemaakt :)",
                "fr": "position des éléments et min - hauteur enfin? corrigé :)",
                "it": "posizione degli elementi e min - altezza finalmente? risolto :)",
                "es": "posición de los elementos y altura mínima finalmente? arreglado :)",
                "pl": "pozycja elementów i wreszcie min - wysokość? naprawiony :)",
                "zh-cn": "元素的位置和最小-高度最终是多少？固定的:)"
            },
            "0.8.14": {
                "en": "border-fix due to changes in css",
                "de": "Border-Fix aufgrund von Änderungen in CSS",
                "ru": "border-fix из-за изменений в css",
                "pt": "border-fix devido a mudanças no css",
                "nl": "border-fix vanwege wijzigingen in css",
                "fr": "border-fix en raison de changements dans le css",
                "it": "correzione del confine a causa di modifiche in css",
                "es": "border-fix debido a cambios en css",
                "pl": "border-fix z powodu zmian w css",
                "zh-cn": "由于CSS更改而导致的边界修复"
            },
            "0.8.13": {
                "en": "bugfix LightIcon not switching\nbugfix Volume Icon not shown if no object is set",
                "de": "Bugfix LightIcon wechselt nicht\nBugfix Volume Icon wird nicht angezeigt, wenn kein Objekt festgelegt ist",
                "ru": "исправление ошибки LightIcon не переключается\nbugfix Значок громкости не отображается, если объект не установлен",
                "pt": "bugfix LightIcon não muda\ncorreção de bug O ícone de volume não é mostrado se nenhum objeto for definido",
                "nl": "bugfix LightIcon schakelt niet over\nbugfix Volumepictogram niet weergegeven als er geen object is ingesteld",
                "fr": "bugfix LightIcon ne bascule pas\nbugfix Icône de volume non affichée si aucun objet n'est défini",
                "it": "bugfix LightIcon non cambia\nbugfix L'icona del volume non viene visualizzata se non è impostato alcun oggetto",
                "es": "corrección de errores LightIcon no cambia\ncorrección de errores El icono de volumen no se muestra si no se establece ningún objeto",
                "pl": "bugfix LightIcon się nie przełącza\nbugfix Ikona głośności nie jest wyświetlana, jeśli żaden obiekt nie jest ustawiony",
                "zh-cn": "错误修正LightIcon无法切换\n如果未设置任何对象，则不显示错误修正卷图标"
            },
            "0.8.12": {
                "en": "Value font-size can be changed now",
                "de": "Der Wert der Schriftgröße kann jetzt geändert werden",
                "ru": "Значение font-size теперь можно изменить",
                "pt": "O valor do tamanho da fonte pode ser alterado agora",
                "nl": "De lettergrootte van de waarde kan nu worden gewijzigd",
                "fr": "La valeur de la taille de police peut être modifiée maintenant",
                "it": "Ora è possibile modificare la dimensione del carattere del valore",
                "es": "El tamaño de fuente del valor se puede cambiar ahora",
                "pl": "Wartość rozmiaru czcionki można teraz zmienić",
                "zh-cn": "值字体大小可以立即更改"
            },
            "0.8.11": {
                "en": "bugfix fo rwrong htm lin Shutter Widget, thx Sigi234",
                "de": "Bugfix für falsches htm lin Shutter Widget, thx Sigi234",
                "ru": "исправление ошибки для виджета затвора htm lin, спасибо Sigi234",
                "pt": "correção de bug para widget do obturador htm lin rwrong, thx Sigi234",
                "nl": "bugfix voor verkeerde htm lin Shutter Widget, thx Sigi234",
                "fr": "correction de bogue pour le widget d'obturation htm lin, thx Sigi234",
                "it": "bugfix per htm lin Shutter Widget errato, grazie a Sigi234",
                "es": "corrección de errores para el widget del obturador rwrong htm lin, gracias Sigi234",
                "pl": "Poprawka błędu rwrong htm lin Shutter Widget, thx Sigi234",
                "zh-cn": "错误的htm lin快门小部件的修正，thgi Sigi234"
            },
            "0.8.10": {
                "en": "rebase to iobroker-ocmmunity-adapter\nadded option to center Icon\nadded option to have ONLY Title and no subtitle",
                "de": "Rebase zum iobroker-ocmmunity-Adapter\nOption zum mittleren Symbol hinzugefügt\nOption hinzugefügt, um NUR Titel und keinen Untertitel zu haben",
                "ru": "переустановить на iobroker-ocmmunity-adapter\nдобавлена возможность центрировать иконку\nдобавлена возможность иметь ТОЛЬКО заголовок и без субтитров",
                "pt": "rebase para iobroker-ocmmunity-adapter\nopção adicionada ao ícone do centro\nopção adicionada para ter APENAS título e nenhum subtítulo",
                "nl": "rebase naar iobroker-ocmmunity-adapter\noptie toegevoegd om pictogram te centreren\noptie toegevoegd om ALLEEN titel en geen ondertitel te hebben",
                "fr": "rebase vers iobroker-ocmmunity-adapter\noption ajoutée pour centrer l'icône\noption ajoutée pour avoir UNIQUEMENT titre et pas de sous-titre",
                "it": "rebase a iobroker-ocmmunity-adapter\naggiunta un'opzione all'icona centrale\naggiunta l'opzione per avere SOLO titolo e nessun sottotitolo",
                "es": "rebase a iobroker-ocmmunity-adapter\nopción agregada al icono central\nopción agregada para tener SOLO título y sin subtítulo",
                "pl": "rebase na iobroker-ocmmunity-adapter\ndodano opcję do ikony środkowej\ndodana opcja posiadania TYLKO tytułu i bez podtytułu",
                "zh-cn": "改用iobroker-ocmununity-adapter\n向中心图标添加了选项\n添加选项以仅具有标题而没有字幕"
            },
            "0.8.9": {
                "en": "added dependeny to icons-mfd-svg ( https://github.com/ioBroker/ioBroker.icons-mfd-svg ),so the icons look nicer and no need to deliver them\nsome icons are missing there, so local icons are still used as well.\n! If you do not install the adapter, the icons on the left side in edit vis will stay empty\nnew units added to number widget",
                "de": "Die Abhängigkeit zu icons-mfd-svg (https://github.com/ioBroker/ioBroker.icons-mfd-svg) wurde hinzugefügt, sodass die Symbole besser aussehen und nicht mehr bereitgestellt werden müssen\nEinige Symbole fehlen dort, daher werden auch weiterhin lokale Symbole verwendet.\n! Wenn Sie den Adapter nicht installieren, bleiben die Symbole auf der linken Seite in edit vis leer\nNeue Einheiten zum Nummern-Widget hinzugefügt",
                "ru": "добавлена зависимость для icons-mfd-svg (https://github.com/ioBroker/ioBroker.icons-mfd-svg), поэтому значки выглядят лучше и не нужно их доставлять\nнекоторые значки там отсутствуют, поэтому локальные значки все еще используются.\n! Если вы не установите адаптер, значки в левой части окна редактирования останутся пустыми.\nновые единицы добавлены в виджет номеров",
                "pt": "adicionou dependeny a icons-mfd-svg (https://github.com/ioBroker/ioBroker.icons-mfd-svg), para que os ícones fiquem mais bonitos e não haja necessidade de entregá-los\nalguns ícones estão faltando lá, portanto, os ícones locais também são usados.\n! Se você não instalar o adaptador, os ícones do lado esquerdo em edit vis ficarão vazios\nnovas unidades adicionadas ao widget de número",
                "nl": "afhankelijkheid toegevoegd aan icons-mfd-svg (https://github.com/ioBroker/ioBroker.icons-mfd-svg), zodat de pictogrammen er mooier uitzien en ze niet hoeven te worden afgeleverd\nsommige pictogrammen ontbreken daar, dus lokale pictogrammen worden ook nog steeds gebruikt.\n! Als u de adapter niet installeert, blijven de pictogrammen aan de linkerkant in edit vis leeg\nnieuwe eenheden toegevoegd aan nummerwidget",
                "fr": "Ajout de la dépendance à icons-mfd-svg (https://github.com/ioBroker/ioBroker.icons-mfd-svg), de sorte que les icônes sont plus jolies et pas besoin de les fournir\ncertaines icônes sont absentes, donc les icônes locales sont toujours utilisées.\n! Si vous n'installez pas l'adaptateur, les icônes sur le côté gauche dans edit vis resteront vides\nnouvelles unités ajoutées au widget numérique",
                "it": "aggiunta la dipendenza a icons-mfd-svg (https://github.com/ioBroker/ioBroker.icons-mfd-svg), quindi le icone hanno un aspetto più gradevole e non è necessario fornirle\nmancano alcune icone, quindi vengono ancora utilizzate anche le icone locali.\n! Se non si installa l'adattatore, le icone sul lato sinistro nella visualizzazione di modifica rimarranno vuote\nnuove unità aggiunte al widget numero",
                "es": "dependencia agregada a icons-mfd-svg (https://github.com/ioBroker/ioBroker.icons-mfd-svg), por lo que los íconos se ven mejor y no es necesario entregarlos\nfaltan algunos iconos, por lo que los iconos locales también se siguen utilizando.\n! Si no instala el adaptador, los iconos del lado izquierdo en la vista de edición permanecerán vacíos\nnuevas unidades agregadas al widget numérico",
                "pl": "dodano zależność do icons-mfd-svg (https://github.com/ioBroker/ioBroker.icons-mfd-svg), dzięki czemu ikony wyglądają ładniej i nie trzeba ich dostarczać\nbrakuje tam niektórych ikon, więc nadal są używane również ikony lokalne.\n! Jeśli nie zainstalujesz adaptera, ikony po lewej stronie w oknie edycji pozostaną puste\nnowe jednostki dodane do widżetu numerycznego",
                "zh-cn": "在icons-mfd-svg（https://github.com/ioBroker/ioBroker.icons-mfd-svg）中添加了dependeny，因此图标看起来更好，不需要交付它们\n那里缺少一些图标，因此仍然使用本地图标。\n！如果您未安装适配器，则“编辑可见”左侧的图标将保持空白\n新单位添加到数字小部件"
            },
            "0.8.8": {
                "en": "added Unit to ListNumber",
                "de": "Unit zu ListNumber hinzugefügt",
                "ru": "добавлен объект в ListNumber",
                "pt": "unidade adicionada a ListNumber",
                "nl": "Unit toegevoegd aan ListNumber",
                "fr": "a ajouté Unit à ListNumber",
                "it": "aggiunta di unità a ListNumber",
                "es": "Unidad agregada a ListNumber",
                "pl": "dodano Unit do ListNumber",
                "zh-cn": "将单位添加到ListNumber"
            },
            "0.8.7": {
                "en": "added new widget thermostat, first try",
                "de": "neuer Widget-Thermostat hinzugefügt, erster Versuch",
                "ru": "добавлен новый виджет термостата, сначала попробуйте",
                "pt": "adicionado novo termostato de widget, primeira tentativa",
                "nl": "nieuwe widget-thermostaat toegevoegd, probeer het eerst",
                "fr": "ajout d'un nouveau thermostat de widget, premier essai",
                "it": "aggiunto un nuovo termostato widget, primo tentativo",
                "es": "nuevo termostato de widget agregado, primer intento",
                "pl": "dodano nowy termostat widżetu, najpierw spróbuj",
                "zh-cn": "添加了新的小部件恒温器，请先尝试"
            },
            "0.8.6": {
                "en": "All properties are now without - sign\nbugfix background-color issue, if corners were round there was different color beneath",
                "de": "Alle Eigenschaften sind jetzt ohne Vorzeichen\nBugfix Hintergrundfarbe Problem, wenn Ecken rund waren, gab es eine andere Farbe darunter",
                "ru": "Все объекты теперь без - подписать\nисправление проблемы с цветом фона, если углы были круглыми, под ними был другой цвет",
                "pt": "Todas as propriedades agora estão sem - sinal\nbug corrigido problema de cor de fundo, se os cantos eram arredondados, havia uma cor diferente abaixo",
                "nl": "Alle eigendommen zijn nu zonder - teken\nbugfix probleem met achtergrondkleur, als hoeken rond waren, was er een andere kleur onder",
                "fr": "Toutes les propriétés sont désormais sans signe -\ncorrection d'un problème de couleur d'arrière-plan, si les coins étaient ronds, il y avait une couleur différente en dessous",
                "it": "Tutte le proprietà sono ora senza segno\nbugfix problema di colore di sfondo, se gli angoli erano rotondi c'era un colore diverso sotto",
                "es": "Todas las propiedades están ahora sin - signo\ncorrección de errores problema de color de fondo, si las esquinas eran redondas, había un color diferente debajo",
                "pl": "Wszystkie nieruchomości są teraz bez znaku -\nnaprawiono błąd koloru tła, jeśli rogi były zaokrąglone, pod spodem był inny kolor",
                "zh-cn": "现在所有属性均不带-号\n错误修正背景颜色问题，如果角落是圆的，下面有不同的颜色"
            },
            "0.8.5": {
                "en": "Also Title can be hidden now",
                "de": "Auch Titel kann jetzt ausgeblendet werden",
                "ru": "Также заголовок теперь можно скрыть",
                "pt": "Também o título pode ser escondido agora",
                "nl": "Ook de titel kan nu worden verborgen",
                "fr": "Le titre peut également être masqué maintenant",
                "it": "Anche il titolo può essere nascosto ora",
                "es": "También el título se puede ocultar ahora",
                "pl": "Również tytuł można teraz ukryć",
                "zh-cn": "另外标题现在可以隐藏"
            },
            "0.8.4": {
                "en": "added possibility to hide the icon in each widget\nminor bugfixes\nrefactoring again",
                "de": "Möglichkeit hinzugefügt, das Symbol in jedem Widget auszublenden\nkleinere Bugfixes\nwieder umgestalten",
                "ru": "добавлена возможность скрыть иконку в каждом виджете\nустранение небольших багов\nснова рефакторинг",
                "pt": "possibilidade adicional de ocultar o ícone em cada widget\npequenas correções de bugs\nrefatorando novamente",
                "nl": "mogelijkheid toegevoegd om het pictogram in elke widget te verbergen\nkleine bugfixes\nrefactoring opnieuw",
                "fr": "ajout de la possibilité de masquer l'icône dans chaque widget\ncorrections de bugs mineurs\nrefactoring à nouveau",
                "it": "aggiunta la possibilità di nascondere l'icona in ogni widget\ncorrezioni di bug minori\nrefactoring di nuovo",
                "es": "posibilidad añadida de ocultar el icono en cada widget\ncorrecciones de errores menores\nrefactorizando de nuevo",
                "pl": "dodano możliwość ukrycia ikony w każdym widżecie\nnaprawy niewielkich błędów\nrefaktoryzacja ponownie",
                "zh-cn": "增加了隐藏每个小部件中图标的可能性\n修正了一些小错误\n再次重构"
            },
            "0.8.3": {
                "en": "refactoring js\nrefactoring html\nadded possibility to change Title and Subtitle size\nminor bugfixes",
                "de": "Refactoring js\nHTML umgestalten\nMöglichkeit hinzugefügt, Titel- und Untertitelgröße zu ändern\nkleinere Bugfixes",
                "ru": "рефакторинг js\nрефакторинг html\nдобавлена возможность изменять размер заголовка и субтитров\nустранение небольших багов",
                "pt": "refatorando js\nrefatorando html\npossibilidade adicional de alterar o tamanho do título e do subtítulo\npequenas correções de bugs",
                "nl": "refactoring js\nrefactoring html\nmogelijkheid toegevoegd om titel en ondertitelgrootte te wijzigen\nkleine bugfixes",
                "fr": "refactoring js\nrefactorisation html\najout de la possibilité de changer la taille du titre et du sous-titre\ncorrections de bugs mineurs",
                "it": "refactoring js\nrefactoring html\naggiunta la possibilità di modificare la dimensione del titolo e dei sottotitoli\ncorrezioni di bug minori",
                "es": "refactorización de js\nrefactorización de html\nposibilidad añadida de cambiar el tamaño del título y del subtítulo\ncorrecciones de errores menores",
                "pl": "refaktoryzacja js\nrefaktoryzacja html\ndodano możliwość zmiany rozmiaru tytułu i napisów\nnaprawy niewielkich błędów",
                "zh-cn": "重构js\n重构HTML\n增加了更改标题和字幕大小的可能性\n修正了一些小错误"
            },
            "0.8.2": {
                "en": "width of title can be changed now overall. add $(\"html\").attr(\"style\",\"--title-width:20%\");  into global javascript. Standard now at 30%\ntext-size removed from css. now you can set it again from outside",
                "de": "Die Breite des Titels kann jetzt insgesamt geändert werden. add $ (\"html\"). attr (\"style\", \"- Titelbreite: 20%\"); in globales Javascript. Standard jetzt bei 30%\nTextgröße aus CSS entfernt. Jetzt können Sie es von außen wieder einstellen",
                "ru": "ширину заголовка теперь можно изменять в целом. добавить $ (\"html\"). attr (\"style\", \"- title-width: 20%\"); в глобальный javascript. Стандарт сейчас на 30%\nразмер текста удален из CSS. теперь вы можете снова установить его снаружи",
                "pt": "largura do título pode ser alterada agora em geral. adicione $ (\"html\"). attr (\"estilo\", \"- largura do título: 20%\"); em javascript global. Padrão agora em 30%\ntamanho do texto removido do css. agora você pode configurá-lo novamente de fora",
                "nl": "de breedte van de titel kan nu in het algemeen worden gewijzigd. add $ (\"html\"). attr (\"style\", \"- title-width: 20%\"); naar globaal javascript. Standaard nu op 30%\ntekstgrootte verwijderd uit css. nu kunt u het van buitenaf weer instellen",
                "fr": "la largeur du titre peut être modifiée maintenant globalement. add $ (\"html\"). attr (\"style\", \"- largeur du titre: 20%\"); en javascript global. Standard maintenant à 30%\ntaille du texte supprimée du css. maintenant vous pouvez le régler à nouveau de l'extérieur",
                "it": "ora è possibile modificare la larghezza del titolo in generale. aggiungi $ (\"html\"). attr (\"style\", \"- title-width: 20%\"); in javascript globale. Standard ora al 30%\ndimensione del testo rimossa dal css. ora puoi impostarlo di nuovo dall'esterno",
                "es": "el ancho del título se puede cambiar ahora en general. agregar $ (\"html\"). attr (\"estilo\", \"- título-ancho: 20%\"); en javascript global. Estándar ahora al 30%\ntamaño de texto eliminado de css. ahora puedes configurarlo de nuevo desde afuera",
                "pl": "można teraz ogólnie zmienić szerokość tytułu. dodaj $ (\"html\"). attr (\"styl\", \"- szerokość tytułu: 20%\"); do globalnego javascript. Standard teraz na 30%\nrozmiar tekstu usunięty z css. teraz możesz ustawić go ponownie z zewnątrz",
                "zh-cn": "现在整体上可以更改标题的宽度。添加$（“ html”）。attr（“ style”，“-title-width：20％”）;进入全球javascript。现在标准为30％\n从CSS移除文字大小。现在您可以从外面重新设置"
            },
            "0.8.1": {
                "en": "* new version number\n\ns",
                "de": "* neue Versionsnummer\n\ns",
                "ru": "* номер новой версии\n\ns",
                "pt": "* novo número de versão\n\ns",
                "nl": "* nieuw versienummer\n\ns",
                "fr": "* nouveau numéro de version\n\ns",
                "it": "* nuovo numero di versione\n\nS",
                "es": "* nuevo número de versión\n\ns",
                "pl": "* numer nowej wersji\n\ns",
                "zh-cn": "*新版本号\n\ns"
            },
            "0.8.0": {
                "en": "bugfix for smaller widgets\nnew style for switch item\nremoved text-align for slider",
                "de": "Bugfix für kleinere Widgets\nneuer Stil für Schalterelement\nTextausrichtung für Schieberegler entfernt",
                "ru": "исправление для небольших виджетов\nновый стиль для переключателя\nубрано выравнивание текста для слайдера",
                "pt": "correção de bug para widgets menores\nnovo estilo para item de troca\nremoveu o alinhamento de texto do controle deslizante",
                "nl": "bugfix voor kleinere widgets\nnieuwe stijl voor schakelaaritem\nverwijderd text-align voor slider",
                "fr": "correction de bogue pour les petits widgets\nnouveau style pour l'élément de commutation\nsuppression de l'alignement du texte pour le curseur",
                "it": "bugfix per widget più piccoli\nnuovo stile per l'elemento di commutazione\nrimosso l'allineamento del testo per il dispositivo di scorrimento",
                "es": "corrección de errores para widgets más pequeños\nnuevo estilo para el elemento de cambio\nalineación de texto eliminada para el control deslizante",
                "pl": "poprawka dla mniejszych widżetów\nnowy styl elementu przełącznika\nusunięto wyrównanie tekstu dla suwaka",
                "zh-cn": "较小的小部件的错误修正\n开关项目的新样式\n删除了文本对齐滑块"
            },
            "0.8.0-0": {
                "en": "remove test widgets\nrelease",
                "de": "Entfernen Sie Test-Widgets\nFreisetzung",
                "ru": "удалить тестовые виджеты\nрелиз",
                "pt": "remover widgets de teste\nliberação",
                "nl": "verwijder testwidgets\nvrijlating",
                "fr": "supprimer les widgets de test\nLibération",
                "it": "rimuovere i widget di prova\npubblicazione",
                "es": "eliminar widgets de prueba\nlanzamiento",
                "pl": "usuń widżety testowe\nwydanie",
                "zh-cn": "删除测试小部件\n释放"
            }
        },
        "title": "Material Advanced",
        "titleLang": {
            "en": "Material Advanced",
            "de": "Material Advanced",
            "ru": "Расширенный материал",
            "pt": "Material Avançado",
            "nl": "Materiaal geavanceerd",
            "fr": "Matériel avancé",
            "it": "Materiale avanzato",
            "es": "Material avanzado",
            "pl": "Materiał zaawansowany",
            "zh-cn": "材料先进"
        },
        "desc": {
            "en": "This Adapter provides standardized Widgets for vis in ioBroker. Lots of different predifined widgets",
            "de": "Dieser Adapter bietet standardisierte Widgets für vis in ioBroker. ",
            "ru": "Этот адаптер предоставляет стандартизированные виджеты для vis в ioBroker. ",
            "pt": "Este adaptador fornece Widgets padronizados para visualização no ioBroker. ",
            "nl": "Deze adapter biedt gestandaardiseerde widgets voor vis in ioBroker. ",
            "fr": "Cet adaptateur fournit des widgets standardisés pour la visibilité dans ioBroker. ",
            "it": "Questo adattatore fornisce widget standardizzati per vis in ioBroker. ",
            "es": "Este adaptador proporciona widgets estandarizados para vis in ioBroker. ",
            "pl": "Ten adapter zapewnia ustandaryzowane widżety dla vis w ioBroker. ",
            "zh-cn": "该适配器为ioBroker中的vis提供了标准化的小部件。"
        },
        "authors": [
            "EdgarM73 <edgar.miller@gmail.com>"
        ],
        "keywords": [
            "vis",
            "material",
            "widget",
            "iobroker"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "vis-material-advanced.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/iobroker-community-adapters/ioBroker.vis-material-advanced/master/admin/vis-material-advanced.png",
        "readme": "https://github.com/iobroker-community-adapters/ioBroker.vis-material-advanced/blob/master/README.md",
        "loglevel": "info",
        "restartAdapters": [
            "vis"
        ],
        "localLink": "%web_protocol%://%ip%:%web_port%/vis/edit.html",
        "onlyWWW": true,
        "noConfig": true,
        "singleton": true,
        "type": "visualization-widgets",
        "mode": "once",
        "dependencies": [
            "vis",
            "icons-mfd-svg"
        ]
    },
    "native": {
        "option1": true,
        "option2": "42"
    },
    "objects": [],
    "instanceObjects": []
}