{
    "common": {
        "name": "vis-material-advanced",
        "version": "0.8.3",
        "news": {
            "0.8.3": {
                "en": "refactoring js\nrefactoring html\nadded possibility to change Title and Subtitle size\nminor bugfixes",
                "de": "Refactoring js\nHTML umgestalten\nMöglichkeit hinzugefügt, Titel- und Untertitelgröße zu ändern\nkleinere Bugfixes",
                "ru": "рефакторинг js\nрефакторинг html\nдобавлена возможность изменять размер заголовка и субтитров\nустранение небольших багов",
                "pt": "refatorando js\nrefatorando html\npossibilidade adicional de alterar o tamanho do título e do subtítulo\npequenas correções de bugs",
                "nl": "refactoring js\nrefactoring html\nmogelijkheid toegevoegd om titel en ondertitelgrootte te wijzigen\nkleine bugfixes",
                "fr": "refactoring js\nrefactorisation html\najout de la possibilité de changer la taille du titre et du sous-titre\ncorrections de bugs mineurs",
                "it": "refactoring js\nrefactoring html\naggiunta la possibilità di modificare la dimensione del titolo e dei sottotitoli\ncorrezioni di bug minori",
                "es": "refactorización de js\nrefactorización de html\nposibilidad añadida de cambiar el tamaño del título y del subtítulo\ncorrecciones de errores menores",
                "pl": "refaktoryzacja js\nrefaktoryzacja html\ndodano możliwość zmiany rozmiaru tytułu i napisów\nnaprawy niewielkich błędów",
                "zh-cn": "重构js\n重构HTML\n增加了更改标题和字幕大小的可能性\n修正了一些小错误"
            },
            "0.8.2": {
                "en": "width of title can be changed now overall. add $(\"html\").attr(\"style\",\"--title-width:20%\");  into global javascript. Standard now at 30%\ntext-size removed from css. now you can set it again from outside",
                "de": "Die Breite des Titels kann jetzt insgesamt geändert werden. add $ (\"html\"). attr (\"style\", \"- Titelbreite: 20%\"); in globales Javascript. Standard jetzt bei 30%\nTextgröße aus CSS entfernt. Jetzt können Sie es von außen wieder einstellen",
                "ru": "ширину заголовка теперь можно изменять в целом. добавить $ (\"html\"). attr (\"style\", \"- title-width: 20%\"); в глобальный javascript. Стандарт сейчас на 30%\nразмер текста удален из CSS. теперь вы можете снова установить его снаружи",
                "pt": "largura do título pode ser alterada agora em geral. adicione $ (\"html\"). attr (\"estilo\", \"- largura do título: 20%\"); em javascript global. Padrão agora em 30%\ntamanho do texto removido do css. agora você pode configurá-lo novamente de fora",
                "nl": "de breedte van de titel kan nu in het algemeen worden gewijzigd. add $ (\"html\"). attr (\"style\", \"- title-width: 20%\"); naar globaal javascript. Standaard nu op 30%\ntekstgrootte verwijderd uit css. nu kunt u het van buitenaf weer instellen",
                "fr": "la largeur du titre peut être modifiée maintenant globalement. add $ (\"html\"). attr (\"style\", \"- largeur du titre: 20%\"); en javascript global. Standard maintenant à 30%\ntaille du texte supprimée du css. maintenant vous pouvez le régler à nouveau de l'extérieur",
                "it": "ora è possibile modificare la larghezza del titolo in generale. aggiungi $ (\"html\"). attr (\"style\", \"- title-width: 20%\"); in javascript globale. Standard ora al 30%\ndimensione del testo rimossa dal css. ora puoi impostarlo di nuovo dall'esterno",
                "es": "el ancho del título se puede cambiar ahora en general. agregar $ (\"html\"). attr (\"estilo\", \"- título-ancho: 20%\"); en javascript global. Estándar ahora al 30%\ntamaño de texto eliminado de css. ahora puedes configurarlo de nuevo desde afuera",
                "pl": "można teraz ogólnie zmienić szerokość tytułu. dodaj $ (\"html\"). attr (\"styl\", \"- szerokość tytułu: 20%\"); do globalnego javascript. Standard teraz na 30%\nrozmiar tekstu usunięty z css. teraz możesz ustawić go ponownie z zewnątrz",
                "zh-cn": "现在整体上可以更改标题的宽度。添加$（“ html”）。attr（“ style”，“-title-width：20％”）;进入全球javascript。现在标准为30％\n从CSS移除文字大小。现在您可以从外面重新设置"
            },
            "0.8.1": {
                "en": "* new version number\n\ns",
                "de": "* neue Versionsnummer\n\ns",
                "ru": "* номер новой версии\n\ns",
                "pt": "* novo número de versão\n\ns",
                "nl": "* nieuw versienummer\n\ns",
                "fr": "* nouveau numéro de version\n\ns",
                "it": "* nuovo numero di versione\n\nS",
                "es": "* nuevo número de versión\n\ns",
                "pl": "* numer nowej wersji\n\ns",
                "zh-cn": "*新版本号\n\ns"
            },
            "0.8.0": {
                "en": "bugfix for smaller widgets\nnew style for switch item\nremoved text-align for slider",
                "de": "Bugfix für kleinere Widgets\nneuer Stil für Schalterelement\nTextausrichtung für Schieberegler entfernt",
                "ru": "исправление для небольших виджетов\nновый стиль для переключателя\nубрано выравнивание текста для слайдера",
                "pt": "correção de bug para widgets menores\nnovo estilo para item de troca\nremoveu o alinhamento de texto do controle deslizante",
                "nl": "bugfix voor kleinere widgets\nnieuwe stijl voor schakelaaritem\nverwijderd text-align voor slider",
                "fr": "correction de bogue pour les petits widgets\nnouveau style pour l'élément de commutation\nsuppression de l'alignement du texte pour le curseur",
                "it": "bugfix per widget più piccoli\nnuovo stile per l'elemento di commutazione\nrimosso l'allineamento del testo per il dispositivo di scorrimento",
                "es": "corrección de errores para widgets más pequeños\nnuevo estilo para el elemento de cambio\nalineación de texto eliminada para el control deslizante",
                "pl": "poprawka dla mniejszych widżetów\nnowy styl elementu przełącznika\nusunięto wyrównanie tekstu dla suwaka",
                "zh-cn": "较小的小部件的错误修正\n开关项目的新样式\n删除了文本对齐滑块"
            },
            "0.8.0-0": {
                "en": "remove test widgets\nrelease",
                "de": "Entfernen Sie Test-Widgets\nFreisetzung",
                "ru": "удалить тестовые виджеты\nрелиз",
                "pt": "remover widgets de teste\nliberação",
                "nl": "verwijder testwidgets\nvrijlating",
                "fr": "supprimer les widgets de test\nLibération",
                "it": "rimuovere i widget di prova\npubblicazione",
                "es": "eliminar widgets de prueba\nlanzamiento",
                "pl": "usuń widżety testowe\nwydanie",
                "zh-cn": "删除测试小部件\n释放"
            },
            "0.7.0-beta.0": {
                "en": "bugfix new widgets\nAll widgets moved to new CSS Style\nrounded widget possible\nshould not interfere with other Adapters anymore",
                "de": "Bugfix neue Widgets\nAlle Widgets wurden in den neuen CSS-Stil verschoben\nabgerundetes Widget möglich\nsollte andere Adapter nicht mehr stören",
                "ru": "исправление ошибок новых виджетов\nВсе виджеты перенесены в новый стиль CSS\nвозможен закругленный виджет\nне должны больше мешать другим адаптерам",
                "pt": "bug corrigir novos widgets\nTodos os widgets foram movidos para o novo estilo CSS\nwidget arredondado possível\nnão deve interferir mais com outros adaptadores",
                "nl": "bugfix nieuwe widgets\nAlle widgets zijn verplaatst naar de nieuwe CSS-stijl\nafgeronde widget mogelijk\nniet meer interfereren met andere adapters",
                "fr": "bugfix nouveaux widgets\nTous les widgets ont été déplacés vers un nouveau style CSS\nwidget arrondi possible\nne devrait plus interférer avec les autres adaptateurs",
                "it": "bugfix nuovi widget\nTutti i widget sono stati spostati nel nuovo stile CSS\nwidget arrotondato possibile\nnon dovrebbe più interferire con altri adattatori",
                "es": "corrección de errores nuevos widgets\nTodos los widgets se movieron al nuevo estilo CSS\nwidget redondeado posible\nya no debería interferir con otros adaptadores",
                "pl": "naprawa nowych widżetów\nWszystkie widżety zostały przeniesione do nowego stylu CSS\nmożliwy zaokrąglony widżet\nnie powinien już kolidować z innymi adapterami",
                "zh-cn": "修正新的小部件\n所有小部件均移至新的CSS样式\n舍入小部件\n不应再干扰其他适配器"
            },
            "0.6.3": {
                "en": "bugfix valve widget",
                "de": "Bugfix Ventil Widget",
                "ru": "bugfix виджет клапана",
                "pt": "widget de válvula de correção de bug",
                "nl": "bugfix klep widget",
                "fr": "widget de valve de correction de bogue",
                "it": "widget valvola bugfix",
                "es": "widget de válvula de corrección de errores",
                "pl": "Widżet zaworu do naprawy błędów",
                "zh-cn": "错误修正阀小部件"
            },
            "0.6.2": {
                "en": "bugfix valve widget",
                "de": "Bugfix Ventil Widget",
                "ru": "bugfix виджет клапана",
                "pt": "widget de válvula de correção de bug",
                "nl": "bugfix klep widget",
                "fr": "widget de valve de correction de bogue",
                "it": "widget valvola bugfix",
                "es": "widget de válvula de corrección de errores",
                "pl": "Widżet zaworu do naprawy błędów",
                "zh-cn": "错误修正阀小部件"
            },
            "0.6.1": {
                "en": "added two new widgets with complete new css-classes. rounded corner, two value. ",
                "de": "fügte zwei neue Widgets mit komplett neuen CSS-Klassen hinzu. abgerundete Ecke, zwei Werte.",
                "ru": "добавлены два новых виджета с полностью новыми CSS-классами. закругленный угол, два значения.",
                "pt": "adicionou dois novos widgets com novas classes css completas. canto arredondado, dois valores.",
                "nl": "twee nieuwe widgets toegevoegd met compleet nieuwe css-klassen. afgeronde hoek, twee waarden.",
                "fr": "ajouté deux nouveaux widgets avec de nouvelles classes css complètes. coin arrondi, deux valeur.",
                "it": "aggiunti due nuovi widget con nuove classi CSS complete. angolo arrotondato, due valori.",
                "es": "se agregaron dos nuevos widgets con clases CSS completamente nuevas. esquina redondeada, dos valores.",
                "pl": "dodano dwa nowe widżety z kompletnymi nowymi klasami css. zaokrąglony róg, dwie wartości.",
                "zh-cn": "添加了两个具有完整的CSS类的新小部件。圆角，两个值。"
            },
            "0.5.7": {
                "en": "bugfix number widget",
                "de": "Bugfix Nummer Widget",
                "ru": "виджет номера с исправлением ошибок",
                "pt": "widget de número de correção de bug",
                "nl": "bugfix nummer widget",
                "fr": "widget de numéro de correction de bogue",
                "it": "widget numero bugfix",
                "es": "widget de número de corrección de errores",
                "pl": "Widżet numeru poprawki",
                "zh-cn": "错误修正号小部件"
            },
            "0.5.6": {
                "en": "bugfix in Volume Widget due to a typo",
                "de": "Bugfix im Volume Widget aufgrund eines Tippfehlers",
                "ru": "исправление ошибки в Volume Widget из-за опечатки",
                "pt": "correção de bug no Volume Widget devido a um erro de digitação",
                "nl": "bugfix in Volume Widget vanwege een typefout",
                "fr": "correction de bogue dans Volume Widget en raison d'une faute de frappe",
                "it": "bugfix in Volume Widget a causa di un errore di battitura",
                "es": "corrección de errores en el widget de volumen debido a un error tipográfico",
                "pl": "poprawka w Volume Widget z powodu literówki",
                "zh-cn": "由于拼写错误，在体积小部件中的错误修正"
            },
            "0.5.5": {
                "en": "bugfix, changed wrong class",
                "de": "Bugfix, falsche Klasse geändert",
                "ru": "исправление, неверный класс изменен",
                "pt": "correção de bug, classe errada alterada",
                "nl": "bugfix, verkeerde klasse gewijzigd",
                "fr": "correction de bogue, mauvaise classe modifiée",
                "it": "bugfix, cambiato classe sbagliata",
                "es": "corrección de errores, cambio de clase incorrecta",
                "pl": "poprawka, zmieniono złą klasę",
                "zh-cn": "错误修正，更改了错误的类"
            },
            "0.5.3": {
                "en": "Number and Text Widgets now better to use, no icon anymore",
                "de": "Zahlen- und Text-Widgets sind jetzt besser zu verwenden, kein Symbol mehr",
                "ru": "Числовые и текстовые виджеты теперь лучше использовать, иконки больше нет",
                "pt": "Widgets de número e texto agora melhores de usar, sem ícone mais",
                "nl": "Nummer- en tekstwidgets nu beter te gebruiken, geen pictogram meer",
                "fr": "Les widgets numériques et texte sont désormais plus faciles à utiliser, plus d'icône",
                "it": "I widget numerici e di testo ora sono migliori da usare, nessuna icona più",
                "es": "Los widgets de números y texto ahora son mejores de usar, ya no hay íconos",
                "pl": "Widżety numeryczne i tekstowe są teraz lepsze w użyciu, nie ma już ikon",
                "zh-cn": "数字和文本小部件现在更易于使用，不再有图标"
            },
            "0.5.2": {
                "en": "bugfix for style interference with material design widgets. All icons are now changable except dimmer",
                "de": "Bugfix für Stilstörungen bei Materialdesign-Widgets. Alle Symbole außer Dimmer können jetzt geändert werden",
                "ru": "исправление ошибок стиля в виджетах материального дизайна. Изменены все значки, кроме диммера.",
                "pt": "correção de bug para interferência de estilo com widgets de design de material. Todos os ícones agora podem ser alterados, exceto dimmer",
                "nl": "bugfix voor stijlinterferentie met widgets voor materiaalontwerp. Alle pictogrammen zijn nu veranderlijk behalve dimmer",
                "fr": "correction de bogue pour l'interférence de style avec les widgets de conception matérielle. Toutes les icônes sont désormais modifiables sauf le gradateur",
                "it": "bugfix per l'interferenza di stile con i widget di material design. Tutte le icone sono ora modificabili tranne il dimmer",
                "es": "corrección de errores por interferencia de estilo con widgets de diseño de materiales. Todos los iconos ahora se pueden cambiar excepto el atenuador",
                "pl": "poprawka dotycząca ingerencji stylu w widżety Material Design. Wszystkie ikony z wyjątkiem ściemniacza można teraz zmieniać",
                "zh-cn": "修正了材料设计小部件的样式错误。除调光器外，所有图标现在均可更改"
            },
            "0.5.1": {
                "en": "bugfix: all widgets have now default background-color #121212 but can be changed in settings. new widgets number and text",
                "de": "Bugfix: Alle Widgets haben jetzt die Standard-Hintergrundfarbe # 121212, können aber in den Einstellungen geändert werden. neue Widgets Nummer und Text",
                "ru": "исправление: теперь все виджеты имеют цвет фона по умолчанию # 121212, но его можно изменить в настройках. количество новых виджетов и текст",
                "pt": "correção de bug: todos os widgets agora têm a cor de fundo padrão # 121212, mas podem ser alterados nas configurações. número e texto de novos widgets",
                "nl": "bugfix: alle widgets hebben nu standaard achtergrondkleur # 121212 maar kunnen worden gewijzigd in instellingen. nieuwe widgets nummer en tekst",
                "fr": "correction de bogue: tous les widgets ont maintenant la couleur d'arrière-plan par défaut # 121212 mais peuvent être modifiés dans les paramètres. nouveau nombre de widgets et texte",
                "it": "bugfix: tutti i widget hanno ora il colore di sfondo predefinito # 121212 ma possono essere modificati nelle impostazioni. nuovo numero di widget e testo",
                "es": "corrección de errores: todos los widgets tienen ahora el color de fondo predeterminado # 121212, pero se pueden cambiar en la configuración. nuevo número de widgets y texto",
                "pl": "poprawka: wszystkie widżety mają teraz domyślny kolor tła # 121212, ale można je zmienić w ustawieniach. nowy numer i tekst widżetów",
                "zh-cn": "错误修正：所有小部件现在都具有默认的背景色＃121212，但可以在设置中进行更改。新的小部件编号和文本"
            },
            "0.5.0": {
                "en": "reorganized code. added flexible opacity to all widgets. added some colorizeOptions to some widgets",
                "de": "reorganisierter Code. allen Widgets wurde eine flexible Deckkraft hinzugefügt. Einige Widgets wurden mit colorizeOptions versehen",
                "ru": "реорганизованный код. добавлена гибкая непрозрачность для всех виджетов. добавлены опции colorizeOptions для некоторых виджетов",
                "pt": "código reorganizado. adicionou opacidade flexível a todos os widgets. adicionou algumas opções de colorize a alguns widgets",
                "nl": "gereorganiseerde code. flexibele dekking toegevoegd aan alle widgets. enkele colorizeOptions toegevoegd aan sommige widgets",
                "fr": "code réorganisé. ajout d'une opacité flexible à tous les widgets. ajouté des options colorize à certains widgets",
                "it": "codice riorganizzato. aggiunta un'opacità flessibile a tutti i widget. ha aggiunto alcune colorizeOptions ad alcuni widget",
                "es": "código reorganizado. agregó opacidad flexible a todos los widgets. agregó algunas opciones de colorizeOptions a algunos widgets",
                "pl": "zreorganizowany kod. dodano elastyczne krycie do wszystkich widżetów. dodano kilka opcji colorizeOptions do niektórych widżetów",
                "zh-cn": "重组代码。为所有小部件添加了灵活的不透明度。在一些小部件中添加了一些colorizeOptions"
            },
            "0.4.8": {
                "en": "bugfix for icons, added new widget valve",
                "de": "Bugfix für Symbole, neues Widget-Ventil hinzugefügt",
                "ru": "исправление ошибок для иконок, добавлен новый клапан виджета",
                "pt": "correção de bug para ícones, adição de nova válvula de widget",
                "nl": "bugfix voor pictogrammen, nieuwe widgetklep toegevoegd",
                "fr": "correction de bogue pour les icônes, ajout d'une nouvelle valve de widget",
                "it": "bugfix per icone, aggiunta nuova valvola widget",
                "es": "corrección de errores para iconos, nueva válvula de widget agregada",
                "pl": "naprawiono błąd ikon, dodano nowy zawór widżetu",
                "zh-cn": "图标的错误修正，添加了新的小部件阀门"
            },
            "0.4.3": {
                "en": "added new widget Boolean",
                "de": "neues Widget Boolean hinzugefügt",
                "ru": "добавлен новый виджет Boolean",
                "pt": "adicionado novo widget booleano",
                "nl": "nieuwe widget Boolean toegevoegd",
                "fr": "ajout d'un nouveau widget booléen",
                "it": "aggiunto nuovo widget Boolean",
                "es": "agregado nuevo widget booleano",
                "pl": "dodano nowy widget Boolean",
                "zh-cn": "添加了新的小部件布尔"
            },
            "0.4.2": {
                "en": "new version for latest repo",
                "de": "neue Version für das latest Repo",
                "ru": "новая версия для последнего репо",
                "pt": "nova versão para o repo mais recente",
                "nl": "nieuwe versie voor de nieuwste opslagplaats",
                "fr": "nouvelle version pour le dernier dépôt",
                "it": "nuova versione per l'ultimo repo",
                "es": "nueva versión para el último repositorio",
                "pl": "nowa wersja najnowszego repozytorium",
                "zh-cn": "最新版本的最新版本"
            },
            "0.3.5": {
                "en": "testing customizable opacity color",
                "de": "Testen der anpassbaren Deckkraftfarbe",
                "ru": "тестирование настраиваемого цвета непрозрачности",
                "pt": "testando cor de opacidade personalizável",
                "nl": "aanpasbare dekkingskleur testen",
                "fr": "test de la couleur d'opacité personnalisable",
                "it": "testare il colore dell'opacità personalizzabile",
                "es": "prueba de color de opacidad personalizable",
                "pl": "testowanie dostosowywanego koloru krycia",
                "zh-cn": "测试可定制的不透明颜色"
            }
        },
        "title": "Material Advanced",
        "titleLang": {
            "en": "Material Advanced",
            "de": "Material Advanced",
            "ru": "Расширенный материал",
            "pt": "Material Avançado",
            "nl": "Materiaal geavanceerd",
            "fr": "Matériel avancé",
            "it": "Materiale avanzato",
            "es": "Material avanzado",
            "pl": "Materiał zaawansowany",
            "zh-cn": "材料先进"
        },
        "desc": {
            "en": "This Adapter provides standardized Widgets for vis in ioBroker. Lots of different predifined widgets",
            "de": "Dieser Adapter bietet standardisierte Widgets für vis in ioBroker. ",
            "ru": "Этот адаптер предоставляет стандартизированные виджеты для vis в ioBroker. ",
            "pt": "Este adaptador fornece Widgets padronizados para visualização no ioBroker. ",
            "nl": "Deze adapter biedt gestandaardiseerde widgets voor vis in ioBroker. ",
            "fr": "Cet adaptateur fournit des widgets standardisés pour la visibilité dans ioBroker. ",
            "it": "Questo adattatore fornisce widget standardizzati per vis in ioBroker. ",
            "es": "Este adaptador proporciona widgets estandarizados para vis in ioBroker. ",
            "pl": "Ten adapter zapewnia ustandaryzowane widżety dla vis w ioBroker. ",
            "zh-cn": "该适配器为ioBroker中的vis提供了标准化的小部件。"
        },
        "authors": [
            "EdgarM73 <edgar.miller@gmail.com>"
        ],
        "keywords": [
            "vis",
            "material",
            "widget",
            "iobroker"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "vis-material-advanced.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/iobroker-community-adapters/ioBroker.vis-material-advanced/master/admin/vis-material-advanced.png",
        "readme": "https://github.com/iobroker-community-adapters/ioBroker.vis-material-advanced/blob/master/README.md",
        "loglevel": "info",
        "restartAdapters": [
            "vis"
        ],
        "localLink": "%web_protocol%://%ip%:%web_port%/vis/edit.html",
        "onlyWWW": true,
        "noConfig": true,
        "singleton": true,
        "type": "visualization-widgets",
        "mode": "once",
        "dependencies": [
            "vis"
        ]
    },
    "native": {
        "option1": true,
        "option2": "42"
    },
    "objects": [],
    "instanceObjects": []
}